# FloorDirectionNotSpecified Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..FloorDirectionNotSpecified Property
BuiltInFailures..::..SketchFailures Class See Also
---
Structural floor span direction not specified.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FloorDirectionNotSpecified { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FloorDirectionNotSpecified As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FloorDirectionNotSpecified {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace